[Указ Президента РФ от 09.05.2017 N 203 "О Стратегии развития информационного общества в Российской Федерации на 2017 - 2030 годы"](http://www.consultant.ru/document/cons_doc_LAW_216363/)  (warning) Доступен только в нерабочее время (см. также [garant.ru](https://www.garant.ru/products/ipo/prime/doc/71570570/))
Указ Президента РФ от 07.05.2018 N 204 (ред. от 19.07.2018) "О национальных целях и стратегических задачах развития Российской Федерации на период до 2024 года" (warning) Доступен только в нерабочее время (см. также garant.ru)
Распоряжение Правительства РФ от 28.07.2017 N 1632-р <Об утверждении программы "Цифровая экономика Российской Федерации"> (warning) Доступен только в нерабочее время (см. также government.ru)
Паспорт национальной программы «Цифровая экономика Российской Федерации» (источник http://government.ru/info/35568/)
Информационные материалы о национальной программе «Цифровая экономика Российской Федерации» (источник http://government.ru/info/35568/)
Постановление Правительства РФ от 08.06.2011 N 451 (ред. от 25.09.2018) "Об инфраструктуре, обеспечивающей информационно-технологическое взаимодействие информационных систем, используемых для предоставления государственных и муниципальных услуг и исполнения государственных и муниципальных функций в электронной форме" (вместе с "Положением об инфраструктуре, обеспечивающей информационно-технологическое взаимодействие информационных систем, используемых для предоставления государственных и муниципальных услуг и исполнения государственных и муниципальных функций в электронной форме")
Распоряжение Правительства РФ от 25 декабря 2013 г. № 2516-р «Об утверждении Концепции развития механизмов предоставления государственных и муниципальных услуг в электронном виде»
Федеральный закон "О контрактной системе в сфере закупок товаров, работ, услуг для обеспечения государственных и муниципальных нужд" от 05.04.2013 N 44-ФЗ (последняя редакция)
Федеральный закон "Об информации, информационных технологиях и о защите информации" от 27.07.2006 N 149-ФЗ (последняя редакция)
Постановление Правительства РФ от 06.07.2015 N 676 (ред. от 11.04.2019, с изм. от 07.08.2019) "О требованиях к порядку создания, развития, ввода в эксплуатацию, эксплуатации и вывода из эксплуатации государственных информационных систем и дальнейшего хранения содержащейся в их базах данных информации"
Федеральный закон "Об организации предоставления государственных и муниципальных услуг" от 27.07.2010 N 210-ФЗ (последняя редакция)
Постановление Правительства РФ от 25.12.2014 N 1494 (ред. от 20.11.2018) "Об утверждении Правил обмена документами в электронном виде при организации информационного взаимодействия"  (warning) Доступен только в нерабочее время (см. также garant.ru)
Постановление Правительства РФ от 24.10.2011 N 861 (ред. от 25.07.2019) "О федеральных государственных информационных системах, обеспечивающих предоставление в электронной форме государственных и муниципальных услуг (осуществление функций)" (вместе с "Положением о федеральной государственной информационной системе "Федеральный реестр государственных и муниципальных услуг (функций)", "Правилами ведения федеральной государственной информационной системы "Федеральный реестр государственных и муниципальных услуг (функций)", "Положением о федеральной государственной информационной системе "Единый портал государственных и муниципальных услуг (функций)", "Требованиями к региональным порталам государственных и муниципальных услуг (функций)")
Распоряжение Правительства РФ от 28.08.2019 N 1911-р <Об утверждении Концепции создания государственной единой облачной платформы>  (warning) Доступен только в нерабочее время (см. также garant.ru)
План мероприятий по формированию методологии систематизации и кодирования информации, а также совершенствованию и актуализации общероссийских классификаторов, включая подготовку необходимых законодательных и иных нормативных правовых актов
Распоряжение Правительства РФ от 10.05.2014 N 793-р (ред. от 13.10.2017) <Об утверждении Концепции методологии систематизации и кодирования информации, а также совершенствования и актуализации общероссийских классификаторов, реестров и информационных ресурсов>  (warning) Доступен только в нерабочее время (см. также government.ru)
Приказ Минкомсвязи России «О внесении изменений в приказ Министерства связи и массовых коммуникаций Российской Федерации от 19 января 2015 г. №7 “Об утверждении Положения о федеральной государственной информационной системе «Единая система нормативной справочной информации», а также Перечня нормативной справочной информации, подлежащей размещению в федеральной государственной информационной системе «Единая система нормативной справочной информации»”»
Приказ Минкомсвязи России «Об утверждении Положения о федеральной государственной информационной системе “Единая система нормативной справочной информации”, а также Перечня нормативной справочной информации, подлежащей размещению в федеральной государственной информационной системе “Единая система нормативной справочной информации”»
Единая система нормативно-справочной информации (ЕСНСИ). Описание
Постановление Правительства РФ от 01.11.2012 N 1119 "Об утверждении требований к защите персональных данных при их обработке в информационных системах персональных данных"
Постановление Правительства РФ от 08.02.2018 N 127 (ред. от 13.04.2019) "Об утверждении Правил категорирования объектов критической информационной инфраструктуры Российской Федерации, а также перечня показателей критериев значимости объектов критической информационной инфраструктуры Российской Федерации и их значений" (warning) Доступен только в нерабочее время (см. также garant.ru)
Федеральный закон "О техническом регулировании" от 27.12.2002 N 184-ФЗ (последняя редакция)


Документация должна разрабатываться с учётом требований стандартов

ГОСТ 34.602-89 «Информационная технология. Комплекс стандартов на автоматизированные системы. Техническое задание на создание автоматизированной системы» (пример)
ГОСТ 34.603 «Информационная технология. Комплекс стандартов на автоматизированные системы. Виды испытаний автоматизированных систем»
ГОСТ 34.201-89 «Информационная технология. Комплекс стандартов на автоматизированные системы. Виды, комплектность и обозначения документов при создании автоматизированных систем»
РД 50-34.698-90 «Руководящий документ по стандартизации. Методические указания. Информационная технология. Комплекс стандартов на автоматизированные системы. Автоматизированные системы. Требования к содержанию документов»
ГОСТ 34.320-96 Концепции и терминология для концептуальной схемы и информационной базы
ГОСТ 34.321-96 Информационные технологии. Система стандартов по базам данных. Эталонная модель управления
ГОСТ 34.601-90 Автоматизированные системы. Стадии создания
ГОСТ 34.603-92 Информационная технология. Виды испытаний автоматизированных систем
ГОСТ Р ИСО/МЭК 8824-3-2002 Информационная технология. Абстрактная синтаксическая нотация версии один
ГОСТ Р ИСО/МЭК 10746-3-2001 Управление данными и открытая распределенная обработка
ГОСТ Р ИСО/МЭК 15271-02 Процессы жизненного цикла программных средств
ГОСТ Р ИСО/МЭК 15910-2002 Процесс создания документации пользователя программного средства
